In [69]:
import pandas as pd

In [70]:
titanic=pd.read_csv('https://github.com/YBIFoundation/Dataset/raw/main/Titanic.csv')

In [71]:
titanic.head(1000)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,3,0,"Markoff, Mr. Marin",male,35.00,0,0,349213,7.8958,NaN,C,NaN,NaN,NaN
996,3,0,"Markun, Mr. Johann",male,33.00,0,0,349257,7.8958,NaN,S,NaN,NaN,NaN
997,3,1,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C,C,NaN,NaN
998,3,0,"Matinoff, Mr. Nicola",male,NaN,0,0,349255,7.8958,NaN,C,NaN,NaN,NaN
999,3,1,"McCarthy, Miss. Catherine ""Katie""",female,NaN,0,0,383123,7.7500,NaN,Q,15 16,NaN,NaN

In [72]:
titanic.tail()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1304,3,0,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [73]:
data={"Name":["Rahim","karim"],
      "Age":[23,24],
      "Salary":[4000,80000]}
df=pd.DataFrame(data)
print(df)

    Name  Age  Salary
0  Rahim   23    4000
1  karim   24   80000

In [74]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.3+ KB

In [75]:
titanic.describe()

,pclass,survived,age,sibsp,parch,fare,body
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000,121.000000
mean,2.294882,0.381971,29.881138,0.498854,0.385027,33.295479,160.809917
std,0.837836,0.486055,14.413493,1.041658,0.865560,51.758668,97.696922
min,1.000000,0.000000,0.170000,0.000000,0.000000,0.000000,1.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,7.895800,72.000000
50%,3.000000,0.000000,28.000000,0.000000,0.000000,14.454200,155.000000
75%,3.000000,1.000000,39.000000,1.000000,0.000000,31.275000,256.000000
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.329200,328.000000

In [76]:
titanic.isnull().sum()

pclass          0
survived        0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [77]:
titanic["pclass"].duplicated().sum()

1306

In [78]:
titanic['age'].mean()

29.881137667304014

In [79]:
import numpy as np

In [80]:
titanic['age']=titanic['age'].replace(np.nan,29.88)

In [81]:
titanic['fare'].mean()
titanic['fare']=titanic['fare'].replace(np.nan,33)

In [82]:
titanic.isnull().sum()

pclass          0
survived        0
name            0
sex             0
age             0
sibsp           0
parch           0
ticket          0
fare            0
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [83]:
len(titanic[titanic['cabin'].notnull()])

295

In [84]:
len(titanic)

1309

In [85]:
most_frequent_cabin = titanic['cabin'].mode()[0]

In [86]:
most_frequent_cabin

'C23 C25 C27'

In [87]:
# Count the occurrences of each unique value in the 'cabin' column
cabin_counts = titanic['cabin'].value_counts(dropna=False)

# Display the result
print(cabin_counts)

cabin
NaN                1014
C23 C25 C27           6
G6                    5
B57 B59 B63 B66       5
C22 C26               4
                   ...
E63                   1
B102                  1
B39                   1
D40                   1
F38                   1
Name: count, Length: 187, dtype: int64

In [88]:
titanic['cabin']=titanic['cabin'].replace(np.nan,'Unknown')

In [89]:
titanic.isnull().sum()

pclass          0
survived        0
name            0
sex             0
age             0
sibsp           0
parch           0
ticket          0
fare            0
cabin           0
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [90]:
[titanic['cabin'][0]

SyntaxError: incomplete input (772276293.py, line 1)

In [91]:
most_frequent_cabin

'C23 C25 C27'

In [151]:
titanic[titanic['cabin']=='Unknown']

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
13,1,1,"Barber, Miss. Ellen ""Nellie""",female,26.00,0,0,19877,78.8500,Unknown,S,6,229.0,Unknown
18,1,1,"Bazzani, Miss. Albina",female,32.00,0,0,11813,76.2917,D15,C,8,976.0,Unknown
23,1,1,"Bidois, Miss. Rosalie",female,42.00,0,0,PC 17757,227.5250,Unknown,C,4,377.0,Unknown
24,1,1,"Bird, Miss. Ellen",female,29.00,0,0,PC 17483,221.7792,C97,S,8,560.0,Unknown
28,1,1,"Bissette, Miss. Amelia",female,35.00,0,0,PC 17760,135.6333,C99,S,8,642.0,Unknown
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0,2665,14.4542,Unknown,C,Unknown,328.0,Unknown
1305,3,0,"Zabour, Miss. Thamine",female,29.88,1,0,2665,14.4542,Unknown,C,Unknown,847.0,Unknown
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.50,0,0,2656,7.2250,Unknown,C,Unknown,304.0,Unknown
1307,3,0,"Zakarian, Mr. Ortin",male,27.00,0,0,2670,7.2250,Unknown,C,Unknown,721.0,Unknown
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0,315082,7.8750,Unknown,S,Unknown,66.0,Unknown

In [97]:
titanic[titanic['embarked'].isnull()]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
168,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN,6,NaN,NaN
284,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN,6,NaN,"Cincinatti, OH"

In [100]:
frequent_embarked=titanic['embarked'].mode()[0]
print(frequent_embarked)

S

In [103]:
# Count the occurrences of each unique value in the 'cabin' column
cabin_counts = titanic['embarked'].value_counts(dropna=False)

# Display the result
print(cabin_counts)

embarked
S    916
C    270
Q    123
Name: count, dtype: int64

In [102]:
titanic['embarked'].fillna('S',inplace=True)

In [152]:
# Count the occurrences of each unique value in the 'cabin' column
cabin_counts = titanic['boat'].value_counts(dropna=False)

# Display the result
print(cabin_counts)

boat
Unknown    823
13          39
C           38
15          37
14          33
4           31
10          29
5           27
3           26
9           25
11          25
16          23
8           23
7           23
D           20
6           20
12          19
2           13
A           11
B            9
1            5
5 7          2
C D          2
13 15        2
5 9          1
8 10         1
13 15 B      1
15 16        1
Name: count, dtype: int64

In [109]:
titanic['boat']=titanic['boat'].replace(np.nan,'Unknown')

In [157]:
# Retrieve only the duplicate rows
titanic[titanic['body'].notnull()]

# Display the duplicate rows
titanic[titanic[titanic['body'].notnull()].duplicated()]

Empty DataFrame
Columns: [pclass, survived, name, sex, age, sibsp, parch, ticket, fare, cabin, embarked, boat, body, home.dest]
Index: []

In [141]:
existing_body_values=set(titanic['body'].dropna().astype(int))
print(len(existing_body_values))

121

In [143]:
def generate_unique_value():
    while True:
        random_value=np.random.randint(1,1360)
        if random_value not in existing_body_values:
            existing_body_values.add(random_value)
            return random_value
# Step 3: Replace NaN values with the generated unique values
titanic['body'] = titanic['body'].apply(lambda x: generate_unique_value() if np.isnan(x) else x)

In [144]:
titanic['body']

0       1203.0
1         36.0
2       1077.0
3        135.0
4        624.0
         ...
1304     328.0
1305     847.0
1306     304.0
1307     721.0
1308      66.0
Name: body, Length: 1309, dtype: float64

In [146]:
titanic[titanic['body'].duplicated()]

Empty DataFrame
Columns: [pclass, survived, name, sex, age, sibsp, parch, ticket, fare, cabin, embarked, boat, body, home.dest]
Index: []

In [149]:
titanic.isnull().sum()

pclass       0
survived     0
name         0
sex          0
age          0
sibsp        0
parch        0
ticket       0
fare         0
cabin        0
embarked     0
boat         0
body         0
home.dest    0
dtype: int64

In [148]:
titanic['home.dest']=titanic['home.dest'].replace(np.nan,'Unknown')